namespace Lab11_StudentApp
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("--- Лабораторна робота №11 (Композиція та Агрегація) ---\n");

            // TODO: Завдання 6. Локальна перевірка у Main

            // Крок 1. Створіть автомобіль (викличте конструктор з назвою моделі)


            // Крок 2. Виведіть на екран потужність його двигуна та перевірте метод IsReadyToDrive()


            // Крок 3. Створіть водія і призначте його у властивість CarDriver


            // Крок 4. Напишіть перевірку (if / else) для виведення інформації про водія


            Console.WriteLine("\nЯкщо все працює без помилок — завантажуйте файли на GitHub!");
            Console.ReadLine();
        }
    }
}
