namespace Lab11_StudentApp
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("--- Лабораторна робота №11 (Композиція та Агрегація) ---\n");

            // TODO: Завдання 5. Локальна перевірка

            // Крок 1. Створіть автомобіль (викличте конструктор, передавши назву моделі)


            // Крок 2. Виведіть на екран потужність його двигуна та радіус першого колеса.
            // (Приклад: Console.WriteLine($"Потужність: {myCar.CarEngine.Power}"); )


            // Крок 3. Створіть водія (окремий об'єкт) і "посадіть" його в авто 
            // (присвойте об'єкт водія у властивість CarDriver вашого авто)


            // Крок 4. Напишіть перевірку (if / else). 
            // Якщо CarDriver не дорівнює null, виведіть ім'я водія. 
            // Інакше виведіть "Автомобіль без водія".


            Console.WriteLine("\nЯкщо все виводиться правильно і без помилок — завантажуйте файли на GitHub!");
            Console.ReadLine();
        }
    }
}
